kimnanhee/STM32/GLCD_picture/Core/Src/lcd32.c

#include "stm32f1xx_hal.h"
#include "lcd28.h"
#include "lcd32.h"
#include "stdlib.h"
#include "lcd.h" 


#define LCD32_DBG_LOG

extern const unsigned char asc2_1206[95][12];
extern const unsigned char asc2_1608[95][16];
extern const unsigned char asc2_3216[1][32];
extern const unsigned char icon_demo[63720];
extern const unsigned char BIG_ASCII[195][16];

extern const unsigned int image_data_rgb[24000];

extern unsigned int  POINT_COLOR;
extern unsigned int  BACK_COLOR;

extern u16 lcd_id;	 

void bsp_lcd32_init(void)
{
	HAL_Delay(10);
	LCD_CS_HIGH();

	// LCD Data(0 ~ 7)
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14| GPIO_PIN_15 |GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_SET);  	 
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10, GPIO_PIN_SET);   
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14| GPIO_PIN_15 |GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10, GPIO_PIN_SET );  	 
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 |  GPIO_PIN_15, GPIO_PIN_SET);   
	
	LCD_RESET_LOW();

	LCD_RD_HIGH();
	LCD_WR_HIGH();

	HAL_Delay(10);

	HAL_Delay(10);
	lcd_rst();	

	HAL_Delay(20);
	HAL_Delay(20);
	HAL_Delay(20);
	HAL_Delay(20);

	LCD_PWM_LIGHT_LOW();

	HAL_Delay(5); 
	lcd_wr_reg_value(0x0000,0x0001);
	HAL_Delay(10); 
	
	
	// HX8347A device id(Himax ID code)	= 0x0047
	lcd_wr_reg(0x0067);
	lcd_id = lcd_rd_data();
	
	if(lcd_id != 0x0047)
	{		
		// ILI93xx Series device id
		HAL_Delay(5); 
		lcd_wr_reg(0x0000);
		lcd_id = lcd_rd_data();
	}
	
	
	if(lcd_id==0x9220 )	// ILI9220
	{
		lcd_wr_reg_value(0x0001,0x001B);
		lcd_wr_reg_value(0x0002,0x0700);
		lcd_wr_reg_value(0x0003,0x1030);
		lcd_wr_reg_value(0x0004,0x0000);     
		lcd_wr_reg_value(0x0005,0x0000);
		lcd_wr_reg_value(0x0007,0x0004);      
		lcd_wr_reg_value(0x0008,0x0202);
		lcd_wr_reg_value(0x0009,0x0000);
		lcd_wr_reg_value(0x000B,0x0004);  
		lcd_wr_reg_value(0x000C,0x0003);
		lcd_wr_reg_value(0x000B,0x0004);
		lcd_wr_reg_value(0x0021,0x0000);
		lcd_wr_reg_value(0x0040,0x0000);
		lcd_wr_reg_value(0x0041,0x00EF);
		lcd_wr_reg_value(0x0042,0xDB00);
		lcd_wr_reg_value(0x0043,0xDB00);
		lcd_wr_reg_value(0x0044,0xAF00);
		lcd_wr_reg_value(0x0045,0xDB00);
		HAL_Delay(10);
		
		//################# void Gamma_Set(void) ####################//
		lcd_wr_reg_value(0x0030,0x0000);  
		lcd_wr_reg_value(0x0031,0x0704);  
		lcd_wr_reg_value(0x0032,0x0004);  
		lcd_wr_reg_value(0x0033,0x0604);  
		lcd_wr_reg_value(0x0034,0x0307);  
		lcd_wr_reg_value(0x0035,0x0103);  
		lcd_wr_reg_value(0x0036,0x0707);  
		lcd_wr_reg_value(0x0037,0x0603);  
		lcd_wr_reg_value(0x0038,0x0000);  
		lcd_wr_reg_value(0x0039,0x0000);
		//############# void Power_Set(void) ################//
		lcd_wr_reg_value(0x0010,0x0000);
		lcd_wr_reg_value(0x0011,0x0000);
		lcd_wr_reg_value(0x0013,0x1413);
		lcd_wr_reg_value(0x0012,0x0008);
		HAL_Delay(10);
		lcd_wr_reg_value(0x0012,0x0018);
		HAL_Delay(10);
		lcd_wr_reg_value(0x0010,0x0140);
		HAL_Delay(20);
		lcd_wr_reg_value(0x0013,0x3414);
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0010,0x2140);
		
		//################## void Display_ON(void) ####################//
		lcd_wr_reg_value(0x0010,0x4040);
		lcd_wr_reg_value(0x0007,0x0005);
		HAL_Delay(4);
		lcd_wr_reg_value(0x0007,0x0025);
		lcd_wr_reg_value(0x0007,0x0027);
		HAL_Delay(4);
		lcd_wr_reg_value(0x0007,0x0037);
		HAL_Delay(1);

	}
	else if(lcd_id==0x9325||lcd_id==0x9328)//ILI9325
	{
		lcd_wr_reg_value(0x00e7,0x0010);      
		lcd_wr_reg_value(0x0000,0x0001); // opening internal clock
		lcd_wr_reg_value(0x0001,0x0100);     
		lcd_wr_reg_value(0x0002,0x0700); // power source opening                    
		//lcd_wr_reg_value (0x0003,(1<<3)|(1<<4)); 	//65K RGB
		//DRIVE TABLE (register 03H)
		//BIT3 =AM BIT4:5=ID0:1
		//AM ID0 ID1 FUNCATION
		// 0 0 0 R->L D->U
		// 1 0 0 D->U R->L
		// 0 1 0 L->R D->U
		// 1 1 0 D->U L->R
		// 0 0 1 R->L U->D
		// 1 0 1 U->D R->L
		// 0 1 1 L->R U->D normal uses this.  	
		// 1 1 1 U->D L->R
        lcd_wr_reg_value(0x0003,(1<<12)|(3<<4)|(0<<3)); //65K    
        lcd_wr_reg_value(0x0004,0x0000);                                   
        lcd_wr_reg_value(0x0008,0x0207);	           
        lcd_wr_reg_value(0x0009,0x0000);         
        lcd_wr_reg_value(0x000a,0x0000); //display setting         
        lcd_wr_reg_value(0x000c,0x0001); //display setting          
        lcd_wr_reg_value(0x000d,0x0000); //0f3c          
        lcd_wr_reg_value(0x000f,0x0000);
		// power source disposition
        lcd_wr_reg_value(0x0010,0x0000);   
        lcd_wr_reg_value(0x0011,0x0007);
        lcd_wr_reg_value(0x0012,0x0000);                                                                 
        lcd_wr_reg_value(0x0013,0x0000);                 
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0010,0x1590);   
        lcd_wr_reg_value(0x0011,0x0227);
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0012,0x009c);                  
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0013,0x1900);   
        lcd_wr_reg_value(0x0029,0x0023);
        lcd_wr_reg_value(0x002b,0x000e);
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0020,0x0000);                                                            
        lcd_wr_reg_value(0x0021,0x013f);           
		HAL_Delay(5); 
		// gamma adjustment
        lcd_wr_reg_value(0x0030,0x0007); 
        lcd_wr_reg_value(0x0031,0x0707);   
        lcd_wr_reg_value(0x0032,0x0006);
        lcd_wr_reg_value(0x0035,0x0704);
        lcd_wr_reg_value(0x0036,0x1f04); 
        lcd_wr_reg_value(0x0037,0x0004);
        lcd_wr_reg_value(0x0038,0x0000);        
        lcd_wr_reg_value(0x0039,0x0706);     
        lcd_wr_reg_value(0x003c,0x0701);
        lcd_wr_reg_value(0x003d,0x000f);
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0050,0x0000); // level GRAM reference 
        lcd_wr_reg_value(0x0051,0x00ef); // level GRAM terminated the position                    
        lcd_wr_reg_value(0x0052,0x0000); // vertical GRAM reference                    
        lcd_wr_reg_value(0x0053,0x013f); // vertical GRAM terminated the position  
        
        lcd_wr_reg_value(0x0060,0xa700);        
        lcd_wr_reg_value(0x0061,0x0001); 
        lcd_wr_reg_value(0x006a,0x0000);
        lcd_wr_reg_value(0x0080,0x0000);
        lcd_wr_reg_value(0x0081,0x0000);
        lcd_wr_reg_value(0x0082,0x0000);
        lcd_wr_reg_value(0x0083,0x0000);
        lcd_wr_reg_value(0x0084,0x0000);
        lcd_wr_reg_value(0x0085,0x0000);
      
