kimnanhee/STM32/GLCD_picture/Core/Src/lcd32.c
        lcd_wr_reg_value(0x0090,0x0010);     
        lcd_wr_reg_value(0x0092,0x0000);  
        lcd_wr_reg_value(0x0093,0x0003);
        lcd_wr_reg_value(0x0095,0x0110);
        lcd_wr_reg_value(0x0097,0x0000);        
        lcd_wr_reg_value(0x0098,0x0000);  
        // opens the demonstration establishment    
        lcd_wr_reg_value(0x0007,0x0133);   
        lcd_wr_reg_value(0x0020,0x0000);                                                            
        lcd_wr_reg_value(0x0021,0x013f);
	} 
	else if(lcd_id==0x9320 || lcd_id==0x9300)
	{
		lcd_wr_reg_value(0x00,0x0001);

		HAL_Delay(50);
		
		lcd_wr_reg_value(0x01,0x0100);	//Driver Output Contral.
		lcd_wr_reg_value(0x02,0x0700);	//LCD Driver Waveform Contral.
		HAL_Delay(20); 
		
		
		// ���θ��
		lcd_wr_reg_value(0x03,0x1010); //Entry Mode establishment 	   
		// ���θ��
		//lcd_wr_reg_value(0x03,0x1018); 
		
		HAL_Delay(20); 
	
		lcd_wr_reg_value(0x04,0x0000);	//Scalling Contral.
		lcd_wr_reg_value(0x08,0x0202);	//Display Contral 2. (0x0207)
		lcd_wr_reg_value(0x09,0x0000);	//Display Contral 3. (0x0000)
		lcd_wr_reg_value(0x0a,0x0000);	//Frame Cycle Contal. (0x0000)
		lcd_wr_reg_value(0x0c,(1<<0));	//Extern Display Interface Contral 1. (0x0000)
		lcd_wr_reg_value(0x0d,0x0000);	//Frame Maker Position.
		lcd_wr_reg_value(0x0f,0x0000);	//Extern Display Interface Contral 2.	    

		HAL_Delay(20); 
		lcd_wr_reg_value(0x07,0x0101);	//Display Contral.
		HAL_Delay(20); 								  

		lcd_wr_reg_value(0x10,(1<<12)|(0<<8)|(1<<7)|(1<<6)|(0<<4));	//Power Control 1. (0x16b0)
		HAL_Delay(20); 
		lcd_wr_reg_value(0x11,0x0007);								//Power Control 2. (0x0001)
		HAL_Delay(40); 
		lcd_wr_reg_value(0x12,(1<<8)|(1<<4)|(0<<0));				//Power Control 3. (0x0138)
		HAL_Delay(40); 
		lcd_wr_reg_value(0x13,0x0b00);								//Power Control 4.
		HAL_Delay(20); 
		lcd_wr_reg_value(0x29,0x0000);								//Power Control 7.
		HAL_Delay(20); 
	
		lcd_wr_reg_value(0x2b,(1<<14)|(1<<4));	    
		lcd_wr_reg_value(0x50,0);	//Set X Star
		// level GRAM terminated position Set X End.
		lcd_wr_reg_value(0x51,239);	//Set Y Star
		lcd_wr_reg_value(0x52,0);	//Set Y End.t.
		lcd_wr_reg_value(0x53,319);	//
		HAL_Delay(20); 
	
		lcd_wr_reg_value(0x60,0x2700);	//Driver Output Control.
		lcd_wr_reg_value(0x61,0x0001);	//Driver Output Control.
		lcd_wr_reg_value(0x6a,0x0000);	//Vertical Srcoll Control.
		HAL_Delay(20); 
	
		lcd_wr_reg_value(0x80,0x0000);	//Display Position? Partial Display 1.
		lcd_wr_reg_value(0x81,0x0000);	//RAM Address Start? Partial Display 1.
		lcd_wr_reg_value(0x82,0x0000);	//RAM Address End-Partial Display 1.
		lcd_wr_reg_value(0x83,0x0000);	//Displsy Position? Partial Display 2.
		lcd_wr_reg_value(0x84,0x0000);	//RAM Address Start? Partial Display 2.
		lcd_wr_reg_value(0x85,0x0000);	//RAM Address End? Partial Display 2.
		HAL_Delay(20); 
	
		lcd_wr_reg_value(0x90,(0<<7)|(16<<0));	//Frame Cycle Contral. (0x0013)
		lcd_wr_reg_value(0x92,0x0000);	//Panel Interface Contral 2. (0x0000)
		lcd_wr_reg_value(0x93,0x0001);	//Panel Interface Contral 3.
		lcd_wr_reg_value(0x95,0x0110);	//Frame Cycle Contral. (0x0110)
		lcd_wr_reg_value(0x97,(0<<8));	//
		lcd_wr_reg_value(0x98,0x0000);	//Frame Cycle Contral.	   

		lcd_wr_reg_value(0x07,0x0173);	// (0x0173)
		HAL_Delay(40);
	} 
	else if(lcd_id==0x5408)
	{
#if 1	
		lcd_wr_reg_value(0x01,0x0100);								  
		lcd_wr_reg_value(0x02,0x0700); //LCD Driving Waveform Contral 

		// ���θ��
		//lcd_wr_reg_value(0x03,0x1030); //Entry Mode establishment 	   
		lcd_wr_reg_value(0x03,0x1010);
		// ���θ��
		//lcd_wr_reg_value(0x03,0x1018); 
		
		// indicator top-down increases the pattern automatically from left to right
		//Normal Mode (Window Mode disable)
		//RGB form
		//16 bit data 2 transmission 8 main line establishments
		lcd_wr_reg_value(0x04,0x0000); //Scalling Control register     
		lcd_wr_reg_value(0x08,0x0207); //Display Control 2 
		lcd_wr_reg_value(0x09,0x0000); //Display Control 3	 
		lcd_wr_reg_value(0x0A,0x0000); //Frame Cycle Control	 
		lcd_wr_reg_value(0x0C,0x0000); //External Display Interface Control 1 
		lcd_wr_reg_value(0x0D,0x0000); //Frame Maker Position		 
		lcd_wr_reg_value(0x0F,0x0000); //External Display Interface Control 2 
 		HAL_Delay(20);
		//TFT liquid crystal color image display packing 14
		lcd_wr_reg_value(0x10,0x16B0); //0x14B0 //Power Control 1
		lcd_wr_reg_value(0x11,0x0001); //0x0007 //Power Control 2
		lcd_wr_reg_value(0x17,0x0001); //0x0000 //Power Control 3
		lcd_wr_reg_value(0x12,0x0138); //0x013B //Power Control 4
		lcd_wr_reg_value(0x13,0x0800); //0x0800 //Power Control 5

		// ���� �߰� ��
	     //lcd_wr_reg_value(0x0020,0x00ef);
	     //lcd_wr_reg_value(0x0021,0x013f);
		// ���� �߰� ��
		
		lcd_wr_reg_value(0x29,0x0009); //NVM read data 2
		lcd_wr_reg_value(0x2a,0x0009); //NVM read data 3
		lcd_wr_reg_value(0xa4,0x0000);	 
		lcd_wr_reg_value(0x50,0x0000); // establishes the operation window X axis to start the row
		lcd_wr_reg_value(0x51,0x00EF); // establishes the operation window X axis conclusion row
		lcd_wr_reg_value(0x52,0x0000); // establishes the operation window the Y axis to start the line
		lcd_wr_reg_value(0x53,0x013F); // establishes the operation window the Y axis conclusion line

		lcd_wr_reg_value(0x60,0x2700); //Driver Output Control  --> original
		//lcd_wr_reg_value(0x0060, 0xA700); // Gate Scan Line
		
		// establishes screen's points as well as the scanning outset line
		lcd_wr_reg_value(0x61,0x0001); //Driver Output Control
		lcd_wr_reg_value(0x6A,0x0000); //Vertical Scroll Control
		lcd_wr_reg_value(0x80,0x0000); //Display Position - Partial Display 1
		lcd_wr_reg_value(0x81,0x0000); //RAM Address Start - Partial Display 1
		lcd_wr_reg_value(0x82,0x0000); //RAM address End - Partial Display 1
		lcd_wr_reg_value(0x83,0x0000); //Display Position - Partial Display 2
		lcd_wr_reg_value(0x84,0x0000); //RAM Address Start - Partial Display 2
		lcd_wr_reg_value(0x85,0x0000); //RAM address End - Partail Display2
		lcd_wr_reg_value(0x90,0x0013); //Frame Cycle Control
		lcd_wr_reg_value(0x92,0x0000);  //Panel Interface Control 2
		lcd_wr_reg_value(0x93,0x0003); //Panel Interface control 3
		lcd_wr_reg_value(0x95,0x0110);  //Frame Cycle Control
		lcd_wr_reg_value(0x07,0x0173);		 
		HAL_Delay(5);
#endif

