kimnanhee/STM32/GLCD_picture/Core/Src/lcd32.c
#if 0
	lcd_wr_reg_value(0x00E3,0x3008);        
	lcd_wr_reg_value(0x00E7,0x0012);
	lcd_wr_reg_value(0x00Ef,0x1231); 	// Set the internal timing;    
	//initializing funciton 1 
         lcd_wr_reg_value(0x00,0x0001);
         lcd_wr_reg_value(0x01, 0x0000); // set SS and SM bit
         lcd_wr_reg_value(0x02, 0x0700); // set 1 line inversion
        // lcd_wr_reg_value(0x03, 0x10B0); // set GRAM write direction and BGR=1.
#if   ID_AM==000       
	     lcd_wr_reg_value(0x0003,0x1000);
#elif ID_AM==001        
	     lcd_wr_reg_value(0x0003,0x1008);      
#elif ID_AM==010  
	     lcd_wr_reg_value(0x0003,0x1010);        
#elif ID_AM==011
	     lcd_wr_reg_value(0x0003,0x1018);
#elif ID_AM==100  
	     lcd_wr_reg_value(0x0003,0x1020);      
#elif ID_AM==101  
	     lcd_wr_reg_value(0x0003,0x1028);      
#elif ID_AM==110  
	     lcd_wr_reg_value(0x0003,0x1030);      
#elif ID_AM==111  
	     lcd_wr_reg_value(0x0003,0x1038);
#endif    
         lcd_wr_reg_value(0x04, 0x0000); // Resize register
         lcd_wr_reg_value(0x08, 0x0404); // set the back porch and front porch
         lcd_wr_reg_value(0x09, 0x0000); // set non-display area refresh cycle ISC[3:0]
         lcd_wr_reg_value(0x0A, 0x0000); // FMARK function
        // lcd_wr_reg_value(0x0C, 0x0000); // RGB interface setting
        // lcd_wr_reg_value(0x0D, 0x0000); // Frame marker Position
        // lcd_wr_reg_value(0x0F, 0x0000); // RGB interface polarity
//Power On sequence //
         lcd_wr_reg_value(0x10, 0x0080); // SAP, BT[3:0], AP, DSTB, SLP, STB
         lcd_wr_reg_value(0x11, 0x0007); // DC1[2:0], DC0[2:0], VC[2:0]
         lcd_wr_reg_value(0x12, 0x0000); // VREG1OUT voltage
         lcd_wr_reg_value(0x13, 0x0000); // VDV[4:0] for VCOM amplitude
	 lcd_wr_reg_value(0x07, 0x0001); // 
		 
         delay_us(10); // Dis-charge capacitor power voltage
         
         lcd_wr_reg_value(0x10, 0x1590); // SAP, BT[3:0], AP, DSTB, SLP, STB
         lcd_wr_reg_value(0x11, 0x0227); // DC1[2:0], DC0[2:0], VC[2:0]
         delay_us(5); // delay_us 50ms
        
         lcd_wr_reg_value(0x12, 0x001c); // Internal reference voltage= Vci;
         delay_us(5); // delay_us 50ms
         lcd_wr_reg_value(0x13, 0x1500); // Set VDV[4:0] for VCOM amplitude
         lcd_wr_reg_value(0x29, 0x0010); // Set VCM[5:0] for VCOMH
         lcd_wr_reg_value(0x2B, 0x000f); // Set Frame Rate
         delay_us(5); // delay_us 50ms
         
#if   ID_AM==000         
	     lcd_wr_reg_value(0x0020,0x00ef);
	     lcd_wr_reg_value(0x0021,0x013f);      
#elif ID_AM==001
	     lcd_wr_reg_value(0x0020,0x00ef);
	     lcd_wr_reg_value(0x0021,0x013f);      
#elif ID_AM==010
	     lcd_wr_reg_value(0x0020,0x0000);
	     lcd_wr_reg_value(0x0021,0x013f);      
#elif ID_AM==011
	     lcd_wr_reg_value(0x0020,0x0000);
	     lcd_wr_reg_value(0x0021,0x013f);       
#elif ID_AM==100
	     lcd_wr_reg_value(0x0020,0x00ef);
	     lcd_wr_reg_value(0x0021,0x0000);      
#elif ID_AM==101  
	     lcd_wr_reg_value(0x0020,0x00ef);
	     lcd_wr_reg_value(0x0021,0x0000);      
#elif ID_AM==110
	     lcd_wr_reg_value(0x0020,0x0000);
	     lcd_wr_reg_value(0x0021,0x0000);      
#elif ID_AM==111
	     lcd_wr_reg_value(0x0020,0x0000);
	     lcd_wr_reg_value(0x0021,0x0000);         
#endif  
// ----------- Adjust the Gamma Curve ----------//
		lcd_wr_reg_value(0x0030,0x0101);
		lcd_wr_reg_value(0x0031,0x0707);
		lcd_wr_reg_value(0x0032,0x0505);
		lcd_wr_reg_value(0x0035,0x0107);
		lcd_wr_reg_value(0x0036,0x0108);
		lcd_wr_reg_value(0x0037,0x0102);
		lcd_wr_reg_value(0x0038,0x0202);
		lcd_wr_reg_value(0x0039,0x0106);
		lcd_wr_reg_value(0x003C,0x0202);
		lcd_wr_reg_value(0x003D,0x0806);
//------------------ Set GRAM area ---------------//
         lcd_wr_reg_value(0x0050, 0x0000); // Horizontal GRAM Start Address
         lcd_wr_reg_value(0x0051, 0x00EF); // Horizontal GRAM End Address
         lcd_wr_reg_value(0x0052, 0x0000); // Vertical GRAM Start Address
         lcd_wr_reg_value(0x0053, 0x013F); // Vertical GRAM Start Address
         lcd_wr_reg_value(0x0060, 0xA700); // Gate Scan Line
         lcd_wr_reg_value(0x0061, 0x0001); // NDL,VLE, REV
         lcd_wr_reg_value(0x006A, 0x0000); // set scrolling line
//-------------- Partial Display Control ---------//
         lcd_wr_reg_value(0x80, 0x0000);
         lcd_wr_reg_value(0x81, 0x0000);
         lcd_wr_reg_value(0x82, 0x0000);
         lcd_wr_reg_value(0x83, 0x0000);
         lcd_wr_reg_value(0x84, 0x0000);
         lcd_wr_reg_value(0x85, 0x0000);
//-------------- Panel Control -------------------//
         lcd_wr_reg_value(0x90, 0x0010);
         lcd_wr_reg_value(0x92, 0x0000);
         lcd_wr_reg_value(0x93, 0x0003);
         lcd_wr_reg_value(0x95, 0x0110);
         lcd_wr_reg_value(0x97, 0x0000);
         lcd_wr_reg_value(0x98, 0x0000);
         lcd_wr_reg_value(0x07, 0x0173); // 262K color and display ON   0133

		 HAL_Delay(5);
#endif		 
	}	
	else if(lcd_id==0x1505)
	{
		// second release on 3/5, luminance is acceptable, water wave appear during camera preview lcd_wr_reg_value(0x0007,0x0000);
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0012,0x011C); //0x011A   why need to set several times?
        lcd_wr_reg_value(0x00A4,0x0001); //NVM	 
        lcd_wr_reg_value(0x0008,0x000F);
        lcd_wr_reg_value(0x000A,0x0008);
        lcd_wr_reg_value(0x000D,0x0008);	    
  		// gamma adjustment
        lcd_wr_reg_value(0x0030,0x0707);
        lcd_wr_reg_value(0x0031,0x0007); //0x0707
        lcd_wr_reg_value(0x0032,0x0603); 
        lcd_wr_reg_value(0x0033,0x0700); 
        lcd_wr_reg_value(0x0034,0x0202); 
        lcd_wr_reg_value(0x0035,0x0002); //? 0x0606
        lcd_wr_reg_value(0x0036,0x1F0F);
        lcd_wr_reg_value(0x0037,0x0707); //0x0f0f 0x0105
        lcd_wr_reg_value(0x0038,0x0000); 
        lcd_wr_reg_value(0x0039,0x0000); 
        lcd_wr_reg_value(0x003A,0x0707); 
        lcd_wr_reg_value(0x003B,0x0000); //0x0303
        lcd_wr_reg_value(0x003C,0x0007); //0x0707
        lcd_wr_reg_value(0x003D,0x0000); //0x1313//0x1f08
        HAL_Delay(5); 
        lcd_wr_reg_value(0x0007,0x0001);
        lcd_wr_reg_value(0x0017,0x0001); // opens the power source
        HAL_Delay(5); 
  		// power source disposition
        lcd_wr_reg_value(0x0010,0x17A0); 
        lcd_wr_reg_value(0x0011,0x0217); //reference voltage VC[2:0] Vciout = 1.00*Vcivl
        lcd_wr_reg_value(0x0012,0x011E); //0x011c //Vreg1out = Vcilvl*1.80 is it the same as Vgama1out?
        lcd_wr_reg_value(0x0013,0x0F00); //VDV[4:0]-->VCOM Amplitude VcomL = VcomH - Vcom Ampl
        lcd_wr_reg_value(0x002A,0x0000);  
        lcd_wr_reg_value(0x0029,0x000A); //0x0001F Vcomh = VCM1[4:0]*Vreg1out gate source voltage??
        lcd_wr_reg_value(0x0012,0x013E); // 0x013C  power supply on
        //Coordinates Control//
        lcd_wr_reg_value(0x0050,0x0000); //0x0e00
        lcd_wr_reg_value(0x0051,0x00EF); 
        lcd_wr_reg_value(0x0052,0x0000); 
        lcd_wr_reg_value(0x0053,0x013F); 
    	//Pannel Image Control//
        lcd_wr_reg_value(0x0060,0x2700); 
        lcd_wr_reg_value(0x0061,0x0001); 
        lcd_wr_reg_value(0x006A,0x0000); 
        lcd_wr_reg_value(0x0080,0x0000); 
    	//Partial Image Control//
        lcd_wr_reg_value(0x0081,0x0000); 
        lcd_wr_reg_value(0x0082,0x0000); 
        lcd_wr_reg_value(0x0083,0x0000); 
        lcd_wr_reg_value(0x0084,0x0000); 
        lcd_wr_reg_value(0x0085,0x0000); 
  		//Panel Interface Control//
        lcd_wr_reg_value(0x0090,0x0013); //0x0010 frenqucy
        lcd_wr_reg_value(0x0092,0x0300); 
        lcd_wr_reg_value(0x0093,0x0005); 
        lcd_wr_reg_value(0x0095,0x0000); 
        lcd_wr_reg_value(0x0097,0x0000); 
        lcd_wr_reg_value(0x0098,0x0000); 
  
        lcd_wr_reg_value(0x0001,0x0100); 
        lcd_wr_reg_value(0x0002,0x0700); 
        lcd_wr_reg_value(0x0003,0x1030); 
        lcd_wr_reg_value(0x0004,0x0000); 
        lcd_wr_reg_value(0x000C,0x0000); 
        lcd_wr_reg_value(0x000F,0x0000); 
        lcd_wr_reg_value(0x0020,0x0000); 
        lcd_wr_reg_value(0x0021,0x0000); 
        lcd_wr_reg_value(0x0007,0x0021); 
        HAL_Delay(20);
        lcd_wr_reg_value(0x0007,0x0061); 
        HAL_Delay(20);
        lcd_wr_reg_value(0x0007,0x0173); 
        HAL_Delay(20);
	}							 
 
