kimnanhee/STM32/GLCD_picture/Core/Src/lcd32.c
	else if(lcd_id==0x0047)	// HX8347A(Himax)
	{
		lcd_wr_reg_value(0x0019,0x0071);//osc setting //71
		HAL_Delay(10);
		lcd_wr_reg_value(0x0093,0x0000);   //0ff
		lcd_wr_reg_value(0x001B,0x0018);//exit sleep
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x001B,0x0014);//exit sleep
		HAL_Delay(50);
		
		
		/***************display setting*******************/
		
		lcd_wr_reg_value(0x0001,0x0006);//display control 3
		HAL_Delay(10);
		
		//lcd_wr_reg_value(0x0016,0x00c8);//memory access control //c8
		lcd_wr_reg_value(0x0016,0x0008);
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0018,0x0000);//memory access control
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0023,0x0095);//cycle control  //95
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0024,0x0095);//cycle control
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0025,0x00ff);//cycle control
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0027,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0028,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0029,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x002a,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x002c,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x002d,0x0002);// BP/FP SETTING
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x003a,0x0000);//cycle control 1
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x003b,0x0000);//cycle control 2
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x003c,0x00f0);//cycle control 3
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x003d,0x0000);//cycle control 4
		HAL_Delay(20);
		
		
		/**********power setting**********************/
		
		lcd_wr_reg_value(0x0042,0x001f);//BGP control
		HAL_Delay(50);
		
		lcd_wr_reg_value(0x001c,0x0006);// AP2-0 SETTING 
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x001D,0x0000);//VLCD SETTING  
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x001E,0x0000);//VREG3 SETTING  
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x001F,0x00e);//VREG1 //00  //0e
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x0020,0x0010);// VGL/VGH SETTING   
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x0021,0x0011);// DC/DC SETTING   
		HAL_Delay(30);
		
		lcd_wr_reg_value(0x0043,0x0080);//vomg control
		HAL_Delay(50);
		
		lcd_wr_reg_value(0x0044,0x0036);  //vcomh control//35
		HAL_Delay(10);
		
		lcd_wr_reg_value(0x0045,0x000a);//vcom control //0a
		HAL_Delay(20);
		
		/******************GAMMA SETTING***********************/
		
		lcd_wr_reg_value(0x0046,0x0094);//GAMMA control 1  
		
		lcd_wr_reg_value(0x0047,0x0021);//GAMMA control 2  
		
		lcd_wr_reg_value(0x0048,0x0000);//GAMMA control 3   
		
		lcd_wr_reg_value(0x0049,0x0033);//GAMMA control 4  
		
		lcd_wr_reg_value(0x004A,0x0023);//GAMMA control 5  
		
		lcd_wr_reg_value(0x004B,0x0045);//GAMMA control 6   
		
		lcd_wr_reg_value(0x004C,0x0044);//GAMMA control 7 
		
		lcd_wr_reg_value(0x004D,0x0077);//GAMMA control  8 
		
		lcd_wr_reg_value(0x004E,0x0012);//GAMMA control 9   
		
		lcd_wr_reg_value(0x004F,0x0001);//GAMMA control 10 
		
		lcd_wr_reg_value(0x0050,0x0001);//GAMMA control 11  
		
		lcd_wr_reg_value(0x0051,0x0001);//GAMMA control 12  
		HAL_Delay(100);
		/****************display on setting**************/
		
		lcd_wr_reg_value(0x0026,0x0004);
		HAL_Delay(20);
		
		lcd_wr_reg_value(0x0026,0x0024);
		HAL_Delay(20);
		
		lcd_wr_reg_value(0x0026,0x002c);
		HAL_Delay(20);
		
		lcd_wr_reg_value(0x0026,0x003c);
		HAL_Delay(20);
	} 

	// 3.2 lcd backlight on
	LCD_PWM_LIGHT_HIGH(); //--> 3.2 LCD original code	
	HAL_Delay(20);
	
	lcd32_clear_screen(BLUE);
	//lcd32_draw_rectangle(20, 20, 100, 100);
	//lcd32_fill_color(30, 30, 90, 90, RED);
}

// starts to write GRAM
void lcd32_writeram_prepare(void)
{
	lcd_wr_reg(R34);
}	 

void lcd32_setcursor (u16 Xpos, u16 Ypos)
{
	if(lcd_id == 0x0047)
	{
		lcd_wr_reg_value(0x0002,Xpos>>8);	   // Column address start2
		lcd_wr_reg_value(0x0003,Xpos);	   // Column address start1
		lcd_wr_reg_value(0x0004,Xpos>>8);	   // Column address end2
		lcd_wr_reg_value(0x0005,Xpos);	   // Column address end1
		lcd_wr_reg_value(0x0006,Ypos>>8);	   // Row address start2
		lcd_wr_reg_value(0x0007,Ypos);	   // Row address start1
	    lcd_wr_reg_value(0x0008,Ypos>>8);	   // Row address end2
		lcd_wr_reg_value(0x0009,Ypos);	   // Row address end1
	}
	else
	{
		lcd_wr_reg_value (R32, Xpos);
		lcd_wr_reg_value (R33, Ypos);
	}

	//usart1_transmit_string("\r\n2\r\n");
} 

// 320 * 240
void lcd32_clear_screen(unsigned int color)
{                    

	u32 index=0;      


	if(lcd_id == 0x0047)
	{
		// Setcurosr
		lcd_wr_reg_value(0x0002,0x00);	   // Column address start2
		lcd_wr_reg_value(0x0003,0x00);	   // Column address start1
		lcd_wr_reg_value(0x0004,0x00);	   // Column address end2
		lcd_wr_reg_value(0x0005,0xef);	   // Column address end1
		lcd_wr_reg_value(0x0006,0x00);	   // Row address start2
		lcd_wr_reg_value(0x0007,0x00);	   // Row address start1
	    lcd_wr_reg_value(0x0008,0x01);	   // Row address end2
		lcd_wr_reg_value(0x0009,0x3f);	   // Row address end1
		// Setcurosr
	}
	else
	{
		lcd32_setcursor(0x00,0x0000); // establishment cursor position 
	}

	lcd32_writeram_prepare();     // starts to read in GRAM	 	  

	for (index=0; index<320*240; index++)
	{
		lcd_wr_data(color);    
	}
}

// 320 * 240
void lcd32_image(void)
{                    

	u32 index=0;      


	if(lcd_id == 0x0047)
	{
		// Setcurosr
		lcd_wr_reg_value(0x0002,0x00);	   // Column address start2
		lcd_wr_reg_value(0x0003,0x00);	   // Column address start1
		lcd_wr_reg_value(0x0004,0x00);	   // Column address end2
		lcd_wr_reg_value(0x0005,0xef);	   // Column address end1
		lcd_wr_reg_value(0x0006,0x00);	   // Row address start2
		lcd_wr_reg_value(0x0007,0x00);	   // Row address start1
	    lcd_wr_reg_value(0x0008,0x01);	   // Row address end2
		lcd_wr_reg_value(0x0009,0x3f);	   // Row address end1
		// Setcurosr
	}
	else
	{
		lcd32_setcursor(0x00,0x0000); // establishment cursor position 
	}

	lcd32_writeram_prepare();     // starts to read in GRAM	 	  

	for (index=0; index<240*200; index++)
	{
		lcd_wr_data(image_data_rgb[index]);    
	}
}

void lcd32_draw_point (u16 x, u16 y)
{
	lcd32_setcursor(x, y); // establishment cursor position 
	lcd_wr_reg(R34); // starts to read in GRAM
	lcd_wr_data(POINT_COLOR); 
}

void lcd32_draw_point_color (u16 x, u16 y, unsigned int color)
{
	lcd32_setcursor(x, y); // establishment cursor position
	lcd_wr_reg(R34); // starts to read in GRAM
	lcd_wr_data(color);
}

void lcd32_set_window(u16 x1, u16 y1, u16 x2, u16 y2)
{
	if(lcd_id == 0x0047)
	{
		lcd_wr_reg_value(0x0002,x1>>8);	   // Column address start2
		lcd_wr_reg_value(0x0003,x1);	   // Column address start1
		lcd_wr_reg_value(0x0004,x2>>8);	   // Column address end2
		lcd_wr_reg_value(0x0005,x2);	   // Column address end1
		lcd_wr_reg_value(0x0006,y1>>8);	   // Row address start2
		lcd_wr_reg_value(0x0007,y1);	   // Row address start1
	    lcd_wr_reg_value(0x0008,y2>>8);	   // Row address end2
		lcd_wr_reg_value(0x0009,y2);	   // Row address end1
	}
	else
	{
		lcd_wr_reg_value (R80, x1); // horizontal direction GRAM start address
		lcd_wr_reg_value (R81, x2); // horizontal direction GRAM end address
		lcd_wr_reg_value (R82, y1); // vertical direction GRAM start address
		lcd_wr_reg_value (R83, y2); // vertical direction GRAM end address	
	}
}

void lcd32_fill_color(u8 xsta, u16 ysta, u8 xend, u16 yend, u16 color)
{                    
    u32 n;

	// establishment window		
	lcd32_set_window(xsta, ysta, xend, yend);
									
	//lcd_wr_reg_value (R80, xsta); // horizontal direction GRAM start address
	//lcd_wr_reg_value (R81, xend); // horizontal direction GRAM end address
	//lcd_wr_reg_value (R82, ysta); // vertical direction GRAM start address
	//lcd_wr_reg_value (R83, yend); // vertical direction GRAM end address	

